# Week 8 - Wednesday Morning Challenge

This morning challenge will encourage you think through tables and SQL queries. You will learn how to use a new powerful SQL function, built into postgres. We set up the db connections for you so you can focus on building the query.

GA provided database credentials:

psql -h dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com -p 5432 -U dsi_student northwind
password: gastudents

First, let's load in the ipython sql extension so that we can use sql within the ipython notebook.

In [2]:
#Connect to the remote database with paramaters provided
import pandas as pd
#import psycopg2 
import sqlalchemy


engine = sqlalchemy.create_engine('postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com:5432/northwind')

# This can work but sometime there are issues with the connection being specifically supported by psql
# params = {
#   'dbname': 'northwind',
#   'user': 'dsi_student',
#   'password': 'gastudents',
#   'host': 'dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com',
#   'port': 5432
# }

# conn = psycopg2.connect(**params)

Remeber to refer to the schema and tables of northwind database: https://northwinddatabase.codeplex.com/

In [3]:
pd.read_sql_query('SELECT DISTINCT(table_schema) FROM information_schema.tables\
                          ORDER BY 1;',con=engine)

         table_schema
0  information_schema
1          pg_catalog
2              public

In [5]:
# Optional: View tables in this database
#pd.read_sql("SELECT table_schema,table_name, table_type FROM  information_schema.tables WHERE table_schema = 'public';",con=engine)

## Question for the Challenge:

The Senior VP walks into your office 1 hour before a big meeting to ask you to pull data for him. He has a hunch that people who have worked at Northwind longer are *not* doing as well in sales as new people.

There is no time to put things into a presentation, she wants the query output (csv file) and 3 bullet points in an email. Use data from the most recent month in the database. 

Answer the VP's question using SQL query using the RANK() function. 
- Rank function is a type of [window function](https://www.postgresql.org/docs/9.2/static/functions-window.html) 
- Date functions will help you too: [age](https://www.postgresql.org/docs/9.5/static/functions-datetime.html)

__Aside__: What are the potential implications of this information? What does this mean for the sales team? This may put in context the items you want to point out in your email.

In [141]:
#Hint: Print out the "head" of relevant tables. 
# Replace "order_details" below with the relevant tables you will be using for your query.

pd.read_sql_query("SELECT * FROM order_details LIMIT 10", con=engine)

   OrderID  ProductID  UnitPrice  Quantity  Discount
0    10248         11       14.0        12      0.00
1    10248         42        9.8        10      0.00
2    10248         72       34.8         5      0.00
3    10249         14       18.6         9      0.00
4    10249         51       42.4        40      0.00
5    10250         41        7.7        10      0.00
6    10250         51       42.4        35      0.15
7    10250         65       16.8        15      0.15
8    10251         22       16.8         6      0.05
9    10251         57       15.6        15      0.05

## Solution

Hints to the class: 
- Tables: Employees, Order, Order details

In [113]:
# Viewing the attributes of Employees Tables
# Need to get the name and HireDate of the employee
# * BirthDate will not be used since there can be 
#negative legal implications to providing this information on employess
pd.read_sql_query('SELECT count(distinct "EmployeeID") FROM Employees', con=engine)

   count
0      9

In [114]:
pd.read_sql_query('SELECT count(distinct concat("FirstName")) FROM Employees', con=engine)

   count
0      9

In [9]:
pd.read_sql_query("SELECT * FROM orders LIMIT 3", con=engine)

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10248,VINET,5,1996-07-04,1996-08-01,1996-07-16,3,32.38,Vins et alcools Chevalier,59 rue de l'Abbaye,Reims,None,51100,France
1,10249,TOMSP,6,1996-07-05,1996-08-16,1996-07-10,1,11.61,Toms Spezialitäten,Luisenstr. 48,Münster,None,44087,Germany
2,10250,HANAR,4,1996-07-08,1996-08-05,1996-07-12,2,65.83,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,RJ,05454-876,Brazil

In [137]:
solution_query = """
SELECT 
    agg_orders.*
    ,time_e.*
    , rank() over (order by agg_orders.total desc) AS rank
FROM
(SELECT 
eid
, sum(eo.total_order) AS total
, avg(eo.total_order) AS avg_order_by_cust
FROM(
    SELECT 
    "CustomerID"
    , "EmployeeID" as eid
    , DATE("OrderDate") AS orderdate
    , SUM(od.subtotal) AS total_order
    FROM Orders
    LEFT OUTER JOIN 
        (select distinct "OrderID" AS orderid, 
            sum("UnitPrice" * "Quantity" * (1 - "Discount")) as subtotal
        from order_details
        group by "OrderID") od ON od.orderid = "OrderID"
    WHERE date("OrderDate") > date('1998-04-05')
    GROUP BY 1,2,3
) AS eo  
GROUP BY 1
ORDER BY eid) agg_orders

JOIN
(SELECT distinct "EmployeeID" AS eid
    , concat("FirstName",' ', "LastName") AS ename
    , date_part('year', AGE(DATE('1998-05-06'),DATE("HireDate"))) AS years_as_employee
FROM Employees
ORDER BY 1) AS time_e ON  time_e.eid = agg_orders.eid
"""

print "Query with Total Order by Customer Ranked in Recent Month by Employee"
pd.read_sql_query(solution_query, con=engine)

Query with Total Order by Customer Ranked in Recent Month by Employee

,eid,total,avg_order_by_cust,eid,ename,years_as_employee,rank
0,2,27690.904987,1538.383610,2,Andrew Fuller,5,1
1,7,24855.959922,2485.595992,7,Robert King,4,2
2,1,15543.095412,1554.309541,1,Nancy Davolio,6,3
3,4,15388.459960,1398.950905,4,Margaret Peacock,5,4
4,8,13920.699983,1392.069998,8,Laura Callahan,4,5
5,3,12957.354951,1295.735495,3,Janet Leverling,6,6
6,9,9501.499993,2375.374998,9,Anne Dodsworth,3,7
7,6,4049.000000,1012.250000,6,Michael Suyama,4,8
8,5,210.000000,210.000000,5,Steven Buchanan,4,9

In [138]:
solution_query = """
SELECT 
    agg_orders.*
    ,time_e.*
    , rank() over (order by agg_orders.avg_order_by_cust desc) AS rank
FROM
(SELECT 
eid
, sum(eo.total_order) AS total
, avg(eo.total_order) AS avg_order_by_cust
FROM(
    SELECT 
    "CustomerID"
    , "EmployeeID" as eid
    , DATE("OrderDate") AS orderdate
    , SUM(od.subtotal) AS total_order
    FROM Orders
    LEFT OUTER JOIN 
        (select distinct "OrderID" AS orderid, 
            sum("UnitPrice" * "Quantity" * (1 - "Discount")) as subtotal
        from order_details
        group by "OrderID") od ON od.orderid = "OrderID"
    WHERE date("OrderDate") > date('1998-04-05')
    GROUP BY 1,2,3
) AS eo  
GROUP BY 1
ORDER BY eid) agg_orders

JOIN
(SELECT distinct "EmployeeID" AS eid
    , concat("FirstName",' ', "LastName") AS ename
    , date_part('year', AGE(DATE('1998-05-06'),DATE("HireDate"))) AS years_as_employee
FROM Employees
ORDER BY 1) AS time_e ON  time_e.eid = agg_orders.eid
"""

print "Query with Total Order by Customer Ranked in Recent Month by Employee"
#pd.read_sql_query(solution_query, con=engine)

Query with Total Order by Customer Ranked in Recent Month by Employee

,eid,total,avg_order_by_cust,eid,ename,years_as_employee,rank
0,7,24855.959922,2485.595992,7,Robert King,4,1
1,9,9501.499993,2375.374998,9,Anne Dodsworth,3,2
2,1,15543.095412,1554.309541,1,Nancy Davolio,6,3
3,2,27690.904987,1538.383610,2,Andrew Fuller,5,4
4,4,15388.459960,1398.950905,4,Margaret Peacock,5,5
5,8,13920.699983,1392.069998,8,Laura Callahan,4,6
6,3,12957.354951,1295.735495,3,Janet Leverling,6,7
7,6,4049.000000,1012.250000,6,Michael Suyama,4,8
8,5,210.000000,210.000000,5,Steven Buchanan,4,9

In [140]:
#BONUS QUERY
solution_query2 = """
SELECT 
    agg_orders.*
    ,time_e.*
    , rank() over (order by agg_orders.count_customers desc) AS rank
FROM
(SELECT 
eid
, sum(eo.total_order) AS total
, avg(eo.total_order) AS avg_order_by_cust
, count(distinct eo.cid) AS count_customers
FROM(
    SELECT 
    "CustomerID" AS cid
    , "EmployeeID" as eid
    , DATE("OrderDate") AS orderdate
    , SUM(od.subtotal) AS total_order
    FROM Orders
    LEFT OUTER JOIN 
        (select distinct "OrderID" AS orderid, 
            sum("UnitPrice" * "Quantity" * (1 - "Discount")) as subtotal
        from order_details
        group by "OrderID") od ON od.orderid = "OrderID"
    WHERE date("OrderDate") > date('1998-04-05')
    GROUP BY 1,2,3
) AS eo  
GROUP BY 1
ORDER BY eid) agg_orders

JOIN
(SELECT distinct "EmployeeID" AS eid
    , concat("FirstName",' ', "LastName") AS ename
    , date_part('year', AGE(DATE('1998-05-06'),DATE("HireDate"))) AS years_as_employee
FROM Employees
ORDER BY 1) AS time_e ON  time_e.eid = agg_orders.eid
"""

print "Query with Total Order by Customer Ranked in Recent Month by Employee"
pd.read_sql_query(solution_query2, con=engine)

Query with Total Order by Customer Ranked in Recent Month by Employee

,eid,total,avg_order_by_cust,count_customers,eid,ename,years_as_employee,rank
0,2,27690.904987,1538.383610,18,2,Andrew Fuller,5,1
1,7,24855.959922,2485.595992,10,7,Robert King,4,2
2,8,13920.699983,1392.069998,10,8,Laura Callahan,4,2
3,3,12957.354951,1295.735495,10,3,Janet Leverling,6,2
4,4,15388.459960,1398.950905,10,4,Margaret Peacock,5,2
5,1,15543.095412,1554.309541,10,1,Nancy Davolio,6,2
6,9,9501.499993,2375.374998,4,9,Anne Dodsworth,3,7
7,6,4049.000000,1012.250000,4,6,Michael Suyama,4,7
8,5,210.000000,210.000000,1,5,Steven Buchanan,4,9

Potential Bullet Points to VP:
- Years with the company does not determine the success of employee sales. 
- Last month, employees with less years at the company had high average order by customers. While employees with more years at the company had high total orders by customer. 
- The longer an employee stays with the company, the more customers employees are able to build in their portfolio.